Revit 2024 API
PipePressureDropData.FrictionFactor Property
 The friction factor of the pipe.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public double FrictionFactor { get; set; }
Visual Basic
Public Property FrictionFactor As Double
	Get
	Set
Visual C++
public:
property double FrictionFactor {
	double get ();
	void set (double value);
}
See Also
PipePressureDropData Class
Autodesk.Revit.DB.Plumbing Namespace